# Brewfile - PHP/Laravel 개발환경용 패키지 목록

tap "homebrew/cask"
tap "homebrew/services"
tap "shivammathur/php"

# 개발 필수 도구
brew "git"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "curl"
brew "wget"

# PHP 개발 스택
brew "php@8.2"
brew "composer"
brew "php-cs-fixer"

# 데이터베이스
brew "mysql"
brew "redis"
brew "sqlite"

# Node.js (Vue.js, frontend 개발용)
brew "node"
brew "yarn"

# 유용한 CLI 도구들
brew "tree"
brew "htop"
brew "jq"
brew "bat"          # cat 개선 버전
brew "exa"          # ls 개선 버전  
brew "ripgrep"      # grep 개선 버전
brew "fzf"          # 퍼지 파인더
brew "fd"           # find 개선 버전
brew "tldr"         # man 페이지 요약
brew "gh"           # GitHub CLI

# GUI 앱들
cask "claude-code"       # Claude Code - Anthropic의 AI 코딩 도구
cask "visual-studio-code"
cask "docker"
# cask "sequel-pro"      # MySQL GUI (TablePlus 사용)
cask "tableplus"         # 다중 DB GUI (더 현대적)
cask "tinkerwell"        # PHP/Laravel 코드 실행기
# cask "postman"         # API 테스팅 (필요시 주석 해제)
cask "iterm2"            # 터미널 앱
# cask "rectangle"       # 윈도우 관리 (필요시 주석 해제)
cask "the-unarchiver"    # 압축 해제

# 생산성 & 협업 도구
cask "notion"            # 노션 - 메모 & 문서 작성
cask "slack"             # 슬랙 - 팀 커뮤니케이션
cask "obsidian"          # 옵시디언 - 개인 지식 관리
cask "github"            # GitHub Desktop - Git GUI
cask "1password"         # 1Password - 비밀번호 관리자

# 브라우저 (개발용)
cask "google-chrome"
cask "firefox"

# 추가 개발 도구 (선택적)
cask "phpstorm"          # PHP IDE
cask "ray"               # Laravel 디버깅 도구